In [1]:
import pandas as pd

In [2]:
df = pd.DataFrame({
    'id':[1,2,3,4,5],
    'fruit':['apple','apple','banana','banana','banana'],
    'weight':[4,6,1,2,3],
    'region':['China','China','China','Brazil','Brazil']
})
df

   id   fruit  weight  region
0   1   apple       4   China
1   2   apple       6   China
2   3  banana       1   China
3   4  banana       2  Brazil
4   5  banana       3  Brazil

In [3]:
df.groupby('fruit').mean()['weight']

fruit
apple     5.0
banana    2.0
Name: weight, dtype: float64

In [12]:
df_pivot = df.pivot_table(index='region', columns='fruit', values='weight')
df_pivot

fruit   apple  banana
region
Brazil    NaN     2.5
China     5.0     1.0

In [23]:
tmp = df_pivot.reset_index()[['region','apple','banana']]
tmp

fruit  region  apple  banana
0      Brazil    NaN     2.5
1       China    5.0     1.0

In [27]:
tmp.melt(id_vars='region', value_vars=['apple','banana'])

   region   fruit  value
0  Brazil   apple    NaN
1   China   apple    5.0
2  Brazil  banana    2.5
3   China  banana    1.0

In [28]:
tmp.melt(id_vars='region', value_vars=['apple','banana'], value_name='weight')

   region   fruit  weight
0  Brazil   apple     NaN
1   China   apple     5.0
2  Brazil  banana     2.5
3   China  banana     1.0